#include "Framework.h"
#include "LeakChecker.h"	//リークチェッカー

void Framework::Run() {

	//リークチェッカー
	D3DResourceLeakChecker leakChecker;

	//エンジンの取得と初期化
	engine_ = Engine::GetInstance();
	engine_->Initialize(L"LE2A_15_ミカミ_ヒロト_AL3_Game");

	//初期化
	Initialize();

	//ウィンドウのxボタンが押されるまでループ
	while (engine_->ProcessMessage()) {

		///*-----------------------------------------------------------------------*///
		///									更新処理								   ///
		///*-----------------------------------------------------------------------*///

		//エンジン更新
		engine_->Update();
		//フレームワーク更新
		Update();

		// エンジンのImGui更新
		engine_->ImGui();
		// フレームワークのImGui更新
		ImGui();

		///*-----------------------------------------------------------------------*///
		///									描画処理								   ///
		///*-----------------------------------------------------------------------*///

		/// 3D描画前処理（オフスクリーン描画開始）
		engine_->StartDrawOffscreen();

		/// 3D描画（オフスクリーン内、ポストプロセス適用対象）
		DrawOffscreen();

		/// 3D描画後処理（オフスクリーン終了)
		engine_->EndDrawOffscreen();

		/// UI描画前処理(バックバッファ描画開始）
		engine_->StartDrawBackBuffer();

		/// UI描画（バックバッファ直接、ポストプロセス適用外）
		DrawBackBuffer();

		/// UI描画後処理（バックバッファ描画終了）
		engine_->EndDrawBackBuffer();
	}

	///*-----------------------------------------------------------------------*///
	///									終了処理								   ///
	///*-----------------------------------------------------------------------*///

	///終了処理
	Finalize();
	engine_->Finalize();
}
